       CBL CICS('SP,EDF')
       IDENTIFICATION DIVISION.
       PROGRAM-ID. GETSCODE.
       AUTHOR. James O'Grady.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-370.
       OBJECT-COMPUTER.  IBM-370.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 SORTCODE           PIC 9(6) VALUE 987654.
       LINKAGE SECTION.
       01 DFHCOMMAREA.
           03 GETSORTCODEOperation.
             06 SORTCODE pic xXXXXX.
       PROCEDURE DIVISION USING DFHCOMMAREA.
       PREMIERE SECTION.
       A010.
           MOVE LITERAL-SORTCODE
           TO SORTCODE OF DFHCOMMAREA.
           EXEC CICS RETURN
           END-EXEC.
           GOBACK.
